released/M031BSP_I2C_SHT31/SampleCode/Template/sensirion_i2c.c
/*
 * Copyright (c) 2018, Sensirion AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright notice, this
 *   list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 *
 * * Neither the name of Sensirion AG nor the names of its
 *   contributors may be used to endorse or promote products derived from
 *   this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */


#include "sensirion_arch_config.h"
#include "sht3x.h"
#include "sensirion_i2c.h"

#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "i2c_driver.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
 * Select the current i2c bus by index.
 * All following i2c operations will be directed at that bus.
 *
 * THE IMPLEMENTATION IS OPTIONAL ON SINGLE-BUS SETUPS (all sensors on the same
 * bus)
 *
 * @param bus_idx   Bus index to select
 * @returns         0 on success, an error code otherwise
 */
int16_t sensirion_i2c_select_bus(uint8_t bus_idx)
{
	return 0;
}

/**
 * Initialize all hard- and software components that are needed for the I2C
 * communication.
 */
void sensirion_i2c_init(void)
{
	
}

/**
 * Release all resources initialized by sensirion_i2c_init().
 */
void sensirion_i2c_release(void)
{
	
}

/**
 * Execute one read transaction on the I2C bus, reading a given number of bytes.
 * If the device does not acknowledge the read command, an error shall be
 * returned.
 *
 * @param address 7-bit I2C address to read from
 * @param data    pointer to the buffer where the data is to be stored
 * @param count   number of bytes to read from I2C and store in the buffer
 * @returns 0 on success, error code otherwise
 */
int8_t sensirion_i2c_read(uint8_t address, uint8_t* data, uint16_t count)
{
	i2c_reg_read(address ,NULL ,(unsigned char *) data ,count);	
	return 0;	
}

/**
 * Execute one write transaction on the I2C bus, sending a given number of
 * bytes. The bytes in the supplied buffer must be sent to the given address. If
 * the slave device does not acknowledge any of the bytes, an error shall be
 * returned.
 *
 * @param address 7-bit I2C address to write to
 * @param data    pointer to the buffer containing the data to write
 * @param count   number of bytes to read from the buffer and send over I2C
 * @returns 0 on success, error code otherwise
 */
int8_t sensirion_i2c_write(uint8_t address, const uint8_t* data,
                           uint16_t count)
{
    uint16_t reg = 0;

    if (count == 2)
    {
        reg = (data[0]<< 8) | (data[1]);
	    i2c_reg_write(address ,reg ,NULL ,0);        
    }
    else if (count == 4)
    {
        reg = (data[0]<< 8) | (data[1]);

	    i2c_reg_write(address ,reg , (unsigned char *)&data[2] ,2);  
    }

    // printf("WR(%d)0x%2X:0x%4X\r\n" , count , address , reg);

	return 0;	    
}

/**
 * Sleep for a given number of microseconds. The function should delay the
 * execution approximately, but no less than, the given time.
 *
 * When using hardware i2c:
 * Despite the unit, a <10 millisecond precision is sufficient.
 *
 * When using software i2c:
 * The precision needed depends on the desired i2c frequency, i.e. should be
 * exact to about half a clock cycle (defined in
 * `SENSIRION_I2C_CLOCK_PERIOD_USEC` in `sensirion_arch_config.h`).
 *
 * Example with 400kHz requires a precision of 1 / (2 * 400kHz) == 1.25usec.
 *
 * @param useconds the sleep time in microseconds
 */
void sensirion_sleep_usec(uint32_t useconds)
{
	// CLK_SysTickDelay(useconds);
	TIMER_Delay(TIMER0, useconds);    
}


void SHT3x_Checking(void)
{
	#if defined (ENABLE_I2C_POLLING_DISCRETE)    
    while (sht3x_probe(SHT3X_I2C_ADDR_DFLT) != STATUS_OK) {
        printf("SHT sensor probing failed\r\n");
    }
    printf("SHT sensor probing successful\r\n");
    #elif defined (ENABLE_I2C_IRQ)
    const uint16_t READ_STATUS_REG = 0xF32D;
    uint8_t rdata[2] ={0} ;

    i2c_reg_read(SHT3X_I2C_ADDR_DFLT ,READ_STATUS_REG ,(unsigned char *) rdata ,2);	
    printf("SHT sensor probing:0x%2X,0x%2X\r\n" , rdata[0],rdata[1]);

    #endif

}

void SHT3x_GetData(void)    // under loop
{
	#if defined (ENABLE_I2C_POLLING_DISCRETE)     
    int32_t temperature, humidity;    
    int8_t ret;
    /* Measure temperature and relative humidity and store into variables
    * temperature, humidity (each output multiplied by 1000).
    */
    ret = sht3x_measure_blocking_read(SHT3X_I2C_ADDR_DFLT,
                                                &temperature, &humidity);
    if (ret == STATUS_OK) {
        printf("measured temperature: %0.2f degreeCelsius, "
                "measured humidity: %0.2f percentRH\n",
                temperature / 1000.0f, humidity / 1000.0f);
    } else {
        printf("error reading measurement\n");
    }
    sensirion_sleep_usec(1000000);
    #elif defined (ENABLE_I2C_IRQ)

    const uint16_t MEASURE_HPM = 0x2400;
    uint8_t rdata[6] = {0};
    int32_t temperature, humidity; 
    uint16_t words[2] = {0};

    // i2c_reg_write(SHT3X_I2C_ADDR_DFLT ,MEASURE_HPM ,(unsigned char *) rdata ,2);
    // sensirion_sleep_usec(SHT3X_MEASUREMENT_DURATION_USEC);
    u8RxStopAndStart = 0;
    i2c_reg_read(SHT3X_I2C_ADDR_DFLT ,MEASURE_HPM ,(unsigned char *) rdata ,6);	
    sensirion_sleep_usec(SHT3X_MEASUREMENT_DURATION_USEC);

    u8RxStopAndStart = 1;
    i2c_reg_read(SHT3X_I2C_ADDR_DFLT ,MEASURE_HPM ,(unsigned char *) rdata ,6);	

    words[0] =  rdata[0] << 8 | rdata[1];
    words[1] =  rdata[3] << 8 | rdata[4];

    tick_to_temperature(words[0], &temperature);
    tick_to_humidity(words[1], &humidity);
    #if 1
    printf("measured temperature: %0.2f degreeCelsius, "
            "measured humidity: %0.2f percentRH\n",
            temperature / 1000.0f, humidity / 1000.0f);    
    #else
    printf("measured:0x%2X,0x%2X,0x%2X,0x%2X,0x%2X,0x%2X\r\n" , rdata[0],rdata[1],rdata[2],rdata[3],rdata[4],rdata[5]);
    #endif

    sensirion_sleep_usec(1000000);

    #endif    
}

#ifdef __cplusplus
}
#endif /* __cplusplus */

